""" 
1. Напишите программу, которая принимает на вход цифру, 
обозначающую день недели, и проверяет, является ли этот день выходным.
Пример:
- 6 -> да
- 7 -> да
- 1 -> нет 
"""

# day = int(input('Введите день недели числом: '))
# if day > 7 or day < 1:
#     print('Пожалуйста, введите корректное число дня недели')
# elif day == 6 or day == 7:
#     print('Да, это выходной!')
# else:
#     print('Нет, это не выходной.')


# задача с семинара

# day = int(input("Введите цифру дня: "))

# match day:
#     case 1:
#         print("Понедельник день тяжелый")
#     case 2:
#         print("Вторник")
#     case 3:
#         print("Среда")
#     case 4:
#         print("Четверг")
#     case 5:
#         print("Пятница")
#     case 6:
#         print("Суббота")
#     case 7:
#         print("Воскресенье")
#     case _:
#         print("Такого дня недели нет")


